{
  "id": "10",
  "name": "Samsung Galaxy S22",
  "category": "samsung",
  "categoryName": "Samsung",
  "thumbnail": "https://i.imgur.com/UlHSLAE.jpg",
  "versions": [
    {
      "id": "SM-S901B",
      "name": "128GB",
      "originalPrice": 21990000,
      "displayOriginalPrice": "21.990.000₫",
      "salePrice": 18990000,
      "displaySalePrice": "18.990.000₫"
    },
    {
      "id": "SM-S901B/DS",
      "name": "256GB",
      "originalPrice": 23490000,
      "displayOriginalPrice": "23.490.000₫",
      "salePrice": 20490000,
      "displaySalePrice": "20.490.000₫"
    }
  ],
  "colours": [
    {
      "colour": "#373737",
      "secondaryColour": "#1a1a1a",
      "colourName": "Black",
      "thumbnail": "https://i.imgur.com/UlHSLAE.jpg",
      "slideIdx": 0
    },
    {
      "colour": "#364f4c",
      "secondaryColour": "#000202",
      "colourName": "Green",
      "thumbnail": "https://i.imgur.com/Qfa7jRR.jpg",
      "slideIdx": 1
    },
    {
      "colour": "#efdcd8",
      "secondaryColour": "#070000",
      "colourName": "Pink",
      "thumbnail": "https://i.imgur.com/35AQMhD.jpg",
      "slideIdx": 2
    },
    {
      "colour": "#f7f7f7",
      "secondaryColour": "#000710",
      "colourName": "White",
      "thumbnail": "https://i.imgur.com/TS7Yq8l.jpg",
      "slideIdx": 3
    }
  ],
  "screenSize": [6.1],
  "ram": [8],
  "memory": [128, 256],
  "images": [
    "https://i.imgur.com/nX23ubU.jpg",
    "https://i.imgur.com/NjsUtm7.jpg",
    "https://i.imgur.com/wkx7vVI.jpg",
    "https://i.imgur.com/YuxHp8g.jpg"
  ],
  "nSold": 24,
  "spec": {
    "bannerImg": "https://i.imgur.com/vrDT83d.png",
    "collapsedText": "About this item\n • 8K SUPER STEADY VIDEO: Shoot videos that rival how epic your life is with stunning 8K recording, the highest recording resolution available on a smartphone; Video captured is effortlessly smooth, thanks to Auto Focus Video Stabilization on Galaxy S22\n • NIGHTOGRAPHY plus PORTAIT MODE: Capture the night with crystal clear, bright pics and videos, no matter the lighting with Night Mode; Portrait Mode auto-detects and adjusts to what you want front and center, making all your photos worthy of a frame\n • 50MP PHOTO RESOLUTION plus BRIGHT DISPLAY: From elaborate landscapes to intricate creations, capture vivid detail with 50MP resolution; Your favorite content will look even more epic on our brightest display ever with Vision Booster\n • ADAPTIVE COLOR CONTRAST: Streaming on the go, working from your patio or binge-watching late into the night. The Galaxy S22 adaptive screen automatically optimizes color and brightness, outdoors and indoors\n • LONG LASTING BATTERY plus FAST CHARGING: Power every scroll, click, tap and stream all day long with an intelligent battery that works with you, not against you; Dive back into action at a moment’s notice with 25W Super-Fast Charging\n • PREMIUM DESIGN & CRAFTMANSHIP: With a classy, eye-catching glass-metal-glass design, we’re setting a standard for smart phones; With our strongest aluminum frame and the latest Gorilla Glass, this phone is lightweight and durable to help endure scratches and dings\n • LIVE SHARING w/ GOOGLE DUO: Watch viral YouTube videos and content together with your friends, from anywhere",
    "captionText": "*Please note that all functions, features, specs and any other product information provided on any Samsung and subsidiary platform, including but not limited to, benefits, design, pricing, components, performance, availability and capabilities describing the product are subject to change and changed by the company when deemed necessary without any notice or obligation.",
    "contents": [
      {
        "type": "img",
        "content": "https://i.imgur.com/Y5Lij98.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/auiWHN6.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/4nwJmVC.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/MFxRSyf.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/zNZuLT4.jpg"
      }
    ]
  },
  "comments": [
    {
      "id": 0,
      "avatar": "https://i.imgur.com/Eo6AlrJ.jpg",
      "by": "Long Bui",
      "email": "test-longbui@example.com",
      "location": "Ho Chi Minh, Vietnam",
      "locationCode": "vn",
      "memberRank": "Non-vip member",
      "displayTimestamp": "29/05/2022 09:10:00",
      "points": 5,
      "isVerifiedPurchase": true,
      "title": "Compared to a Dying S9, it's Great!",
      "comment": "It's safe to say that my opinion of the S22 is influenced by just how bad my S9 had become.\n I was hesitant to purchase based on reviews mentioning short battery life, but I just didn't want a bigger phone. And compared to my S9 that was dying after 3 hours of use, the S22 is great. Most days I'm able to only charge once every 24 hours. I'm not a gamer or much of a video watcher and I'm sure that helps. It supports my social media habit just fine, as well as emails and googling around.\n And yes, the fingerprint scanner is a bit annoying. With it's constant \"not recognized\". I have found that it works better with a more patient purposeful press. It does not like a quick \"it's me let me in\" finger drive by.\n Being able to keep a reasonable sized phone, the cost, and coming from a phone in it's deathbed, I'm happy overall and glad I stopped deliberating and finally bought it.",
      "nHelpful": 4,
      "colour": {
        "colour": "#f7f7f7",
        "secondaryColour": "#000710",
        "colourName": "White",
        "thumbnail": "https://i.imgur.com/TS7Yq8l.jpg"
      },
      "version": {
        "id": "SM-S901B/DS",
        "name": "256GB",
        "originalPrice": 23490000,
        "displayOriginalPrice": "23.490.000₫",
        "salePrice": 20490000,
        "displaySalePrice": "20.490.000₫"
      },
      "images": []
    }
  ]
}
