{
  "id": "11",
  "name": "Samsung Galaxy Z Flip3",
  "category": "samsung",
  "categoryName": "Samsung",
  "thumbnail": "https://i.imgur.com/qsoXPZ8.jpg",
  "versions": [
    {
      "id": "SM-F711B",
      "name": "128GB",
      "originalPrice": 24990000,
      "displayOriginalPrice": "24.990.000₫",
      "salePrice": 17990000,
      "displaySalePrice": "17.990.000₫"
    },
    {
      "id": "SM-F711N",
      "name": "256GB",
      "originalPrice": 26990000,
      "displayOriginalPrice": "26.990.000₫",
      "salePrice": 19990000,
      "displaySalePrice": "19.990.000₫"
    }
  ],
  "colours": [
    {
      "colour": "#ebe3cc",
      "secondaryColour": "#262626",
      "colourName": "Cream",
      "thumbnail": "https://i.imgur.com/qsoXPZ8.jpg"
    },
    {
      "colour": "#b4b6dc",
      "secondaryColour": "#262626",
      "colourName": "Purple",
      "thumbnail": "https://i.imgur.com/IkACqCA.jpg"
    },
    {
      "colour": "#435154",
      "secondaryColour": "#282828",
      "colourName": "Green",
      "thumbnail": "https://i.imgur.com/7Js6oOc.jpg"
    },
    {
      "colour": "#262626",
      "secondaryColour": "#282828",
      "colourName": "Black",
      "thumbnail": "https://i.imgur.com/l8NAFQN.jpg"
    }
  ],
  "screenSize": [6.7],
  "ram": [8],
  "memory": [128, 256],
  "ratingPoints": 4,
  "numberOfRatings": 30,
  "images": [
    "https://i.imgur.com/9T1au9x.png",
    "https://i.imgur.com/aOUIsxx.jpg",
    "https://i.imgur.com/zxgsPE7.jpg",
    "https://i.imgur.com/kYhDuVO.jpg",
    "https://i.imgur.com/N1Ip8pa.jpg",
    "https://i.imgur.com/nEvqsVh.jpg"
  ],
  "nSold": 24,
  "spec": {
    "bannerImg": "https://i.imgur.com/E2GzhE4.jpg",
    "collapsedText": "About this item\n • Flex Your Best Angle: With Flex Mode, Just Unfold Your Mobile Phone’S Screen To Your Best Angle For Hands-Free Pics And Video Calls; Choose What You Want To Capture, Set It Down, Stand Back And Shoot Your Best Shot\n • A Camera That Goes Steady: Thanks To Samsung Galaxy Z Flip3’S Super Steady Feature, You Can Just Set It Down And Strike A Pose For Picture Perfect Selfies\n • Ultra Compact, Ultra Cool: Show Off Your Style Game Without The Tradeoffs; With A Compact Design That Unfolds, You Don’T Have To Compromise Screen Size For Your Favorite Outfit \n • Array Of Colors: Whether You’Re Into Sophisticated Neutrals Or Vibrant Tones, You’Ll Turn Heads With Every Take; Complete Your Look With Statement-Making Color Choices Of Phantom Black, Lavender, Green, Or Cream",
    "captionText": "*Please note that all functions, features, specs and any other product information provided on any Samsung and subsidiary platform, including but not limited to, benefits, design, pricing, components, performance, availability and capabilities describing the product are subject to change and changed by the company when deemed necessary without any notice or obligation.",
    "contents": [
      {
        "type": "img",
        "content": "https://i.imgur.com/JlTwpSx.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/mMWaYMi.jpg"
      },
      {
        "type": "img",
        "content": "https://i.imgur.com/kFobzks.jpg"
      }
    ]
  },
  "comments": [
    {
      "id": 0,
      "avatar": "https://i.imgur.com/CKYetAR.jpg",
      "by": "Phong Truong",
      "email": "test-phongtruong@example.com",
      "location": "Ho Chi Minh, Vietnam",
      "locationCode": "vn",
      "memberRank": "Non-vip member",
      "displayTimestamp": "18/02/2022 09:10:00",
      "points": 5,
      "isVerifiedPurchase": true,
      "title": "We love our flip phones!",
      "comment": "It was time to get new cell phones - our old Samsung S9's (both me and my wife) are getting pretty old, and the batteries don't last very long anymore. We've had Samsung phones for a while now, so decided to stay with Samsung. I have to admit, getting the flip phone instead of the latest model rectangle was totally emotional - I just think the flip thing is cool! Samsung has done a great job making the hinge area nearly invisible when the phone is open, and from what I read, as long as you're somewhat careful, the flip/hinge will easily last a long time (longer than the battery, no doubt...} Speaking of battery, I have read the flip battery is a compromise and doesn't last as long as an equivalent rectangle phone. This may be true, but I find the battery in this phone lasts plenty long. As long as you're ok with charging it every night, you should be fine. A couple of other notes - Samsung makes it super easy to move all your apps, data, photos, whatever from your old phone to your new phone - their \"switch\" app worked seamlessly. Also, this was a purchase of an \"unlocked\" phone from Amazon. I carefully checked to make sure the 5G and 4G frequency bands covered by this phone were ones my carrier (T-Mobile) uses. Moving the SIM card from my old phone to the new one was all I needed to do to get the new phone to work on my network. The only thing that's missing as far as I can tell is we don't have T-Mobile ring tones anymore. If I cared, I could probably figure out how to download them... Anyway - a few weeks in, and love these phones!",
      "nHelpful": 8,
      "colour": {
        "colour": "#262626",
        "secondaryColour": "#282828",
        "colourName": "Black",
        "thumbnail": "https://i.imgur.com/l8NAFQN.jpg"
      },
      "version": {
        "id": "SM-F711N",
        "name": "256GB",
        "originalPrice": 26990000,
        "displayOriginalPrice": "26.990.000₫",
        "salePrice": 19990000,
        "displaySalePrice": "19.990.000₫"
      },
      "images": []
    }
  ]
}
