{
  "id": "9",
  "name": "Samsung Galaxy A52s",
  "category": "samsung",
  "categoryName": "Samsung",
  "thumbnail": "https://i.imgur.com/XLjmcsH.jpg",
  "versions": [
    {
      "id": "SM-A528B",
      "name": "128GB",
      "originalPrice": 10990000,
      "displayOriginalPrice": "10.990.000₫",
      "salePrice": 8490000,
      "displaySalePrice": "8.490.000₫"
    },
    {
      "id": "SM-A528B/DS",
      "name": "256GB",
      "originalPrice": 11990000,
      "displayOriginalPrice": "11.990.000₫",
      "salePrice": 8690000,
      "displaySalePrice": "8.690.000₫"
    }
  ],
  "colours": [
    {
      "colour": "#b0cfd1",
      "secondaryColour": "#14191d",
      "colourName": "Blue",
      "thumbnail": "https://i.imgur.com/XLjmcsH.jpg"
    },
    {
      "colour": "#abb2ce",
      "secondaryColour": "#14191d",
      "colourName": "Purple",
      "thumbnail": "https://i.imgur.com/D11qbhS.jpg"
    },
    {
      "colour": "#e3e5e4",
      "secondaryColour": "#14191d",
      "colourName": "White",
      "thumbnail": "https://i.imgur.com/Xy8RjNF.jpg"
    }
  ],
  "screenSize": [
    6.5
  ],
  "ram": [
    4,
    6,
    8
  ],
  "memory": [
    128,
    256
  ],
  "ratingPoints": 4,
  "numberOfRatings": 525,
  "images": [
    "https://i.imgur.com/ZfFHJYt.jpg",
    "https://i.imgur.com/i6JskDz.jpg",
    "https://i.imgur.com/AdxP8s4.jpg"
  ],
  "nSold": 24,
  "spec": {
    "bannerImg": "https://i.imgur.com/GzTicDi.jpg",
    "collapsedText": "About this item\n • NOTE: International Version. No Warranty. This device will work with GSM service providers like AT&T, T-Mobile, MetroPCS, and most other GSM service providers. It will not work with CDMA service providers like Verizon, US Cellular, Sprint, or any other CDMA service providers. Please check device compatibility with your cell phone provider before you place your order.\n • Storage: 128GB 6GB RAM\n • Display: 6.5 inches, 102.0 cm2 (~84.9% screen-to-body ratio)\n • Platform: Android 11, One UI 3.1 Qualcomm SM7325 Snapdragon 778G 5G (6 nm)\n • Camera: 64MP Main Camera with OIS for crisp, clear photos throughout the day\n • Battery: Li-Po 4500 mAh, non-removable",
    "captionText": "*Please note that all functions, features, specs and any other product information provided on any Samsung and subsidiary platform, including but not limited to, benefits, design, pricing, components, performance, availability and capabilities describing the product are subject to change and changed by the company when deemed necessary without any notice or obligation.",
    "contents": [
      {
        "type": "text",
        "content": "On the Next-Generation Mobile Data Network, the Power of 5G Fast Speeds Changes the Way you Experience and Share Content — From Super Smooth Gaming and Streaming to Ultra-fast Sharing and Downloading. Upgrade to the Galaxy A52s 5G and Speed up Your Smartphone Experience. Awesome Screen, Super Smooth Scrolling. Feast your Eyes on Vibrant Details With the FHD+ Super AMOLED Display, Reaching 800 Nits for Clarity Even in Bright Daylight. Eye Comfort Shield Lowers Blue Light, and Super Smooth Keeps the View Smooth, Whether you're Gaming or Scrolling. All on the Expansive 6.5-Inch Infinity-O Display. Ultra-Wide Camera, Ultra-Wide Experiences Similar to Human Eyesight, the 12MP Ultra-Wide Camera Sees the World With a 123-Degree Angle of View, Adding More Perspective to Everything You Shoot."
      }
    ]
  }
}
